export const getMockDestinations = () => {
  return new Promise((resolve) => {
    // Simulating network delay
    setTimeout(() => {
      resolve({
        data: {
          suggestions: [
            {
              province: 'fars',
              summary: 'استان فارس یکی از قطب‌های گردشگری ایران است. شیراز، مرکز این استان، با باغ‌های تاریخی، آرامگاه حافظ و سعدی و نزدیکی به تخت جمشید، مقصدی ایده‌آل برای دوستداران تاریخ و فرهنگ استاستان فارس یکی از قطب‌های گردشگری ایران است. شیراز، مرکز این استان، با باغ‌های تاریخی، آرامگاه حافظ و سعدی و نزدیکی به تخت جمشید، مقصدی ایده‌آل برای دوستداران تاریخ و فرهنگ است.',
              url: 'https://example.com/fars'
            },
            {
              province: 'gilan',
              summary: 'اصفهان معروف به نصف جهان، با میدان نقش جهان، سی‌وسه‌پل و معماری بی‌نظیر اسلامی خود شناخته می‌شود. این شهر ترکیبی از هنر، تاریخ و بازارهای سنتی زنده است.',
              url: 'https://example.com/isfahan'
            },
            {
              province: 'azarbaijan_east',
              summary: 'گیلان با طبیعت بکر، جنگل‌های هیرکانی و ساحل دریای خزر، بهشت طبیعت‌گردان است. فرهنگ غذایی غنی و بازارهای محلی رشت از جذابیت‌های اصلی این منطقه محسوب می‌شود.',
              url: 'https://example.com/gilan'
            },
            {
              "province": "alborz",
              "name": "البرز",
              "image": "https://cdn.mashreghnews.ir/d/2020/05/11/4/2793271.jpg"
            },
            {
              "province": "ardabil",
              "name": "اردبیل",
              summary: 'گیلان با طبیعت بکر، جنگل‌های هیرکانی و ساحل دریای خزر، بهشت طبیعت‌گردان است. فرهنگ غذایی غنی و بازارهای محلی رشت از جذابیت‌های اصلی این منطقه محسوب می‌شود.گیلان با طبیعت بکر، جنگل‌های هیرکانی و ساحل دریای خزر، بهشت طبیعت‌گردان است. فرهنگ غذایی غنی و بازارهای محلی رشت از جذابیت‌های اصلی این منطقه محسوب می‌شود.گیلان با طبیعت بکر، جنگل‌های هیرکانی و ساحل دریای خزر، بهشت طبیعت‌گردان است. فرهنگ غذایی غنی و بازارهای محلی رشت از جذابیت‌های اصلی این منطقه محسوب می‌شود.',
              "image": "https://ammi.ir/wp-content/uploads/1__2_-Medium-16.jpg"
            },
            {
              "province": "azarbaijan_east",
              "name": "آذربایجان شرقی",
              "image": "https://ammi.ir/wp-content/uploads/1__6_-72.jpg"
            },
          ]
        }
      });
    }, 1200);
  });
};